1s/ERP/Conf/Catalogs/Лико_Площадки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_Площадки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладГП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УтверждатьЗаказыПередОтправкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресУведомленияПодготовленныеЗаказы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаДляОтчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ГруппировкиОтчетовНаСайте</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадкаМСФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПроизводство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОтпускТовараГП</Name>
					<Comment>будет подставляться в реализацию в поле "Отпустил"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольНаличияФотоБиркиРулонногоМатериала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаКонтроляНаличияФотоБиркиРулонногоМатериала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеховаяКладовая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонвертаПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКонвертов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Конверты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОснастки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Директор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДляБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаПодписьПередач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРаботыВОбработкеПеремоткаУпаковка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БуферСнятыхРоликовПеремотки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_Площадки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция ПлощадкаПоОрганизации(Организация) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Справочники.Лико_Площадки.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(Лико_Площадки.Ссылка) КАК Ссылка
	|ИЗ
	|	Справочник.Лико_Площадки КАК Лико_Площадки
	|ГДЕ
	|	Лико_Площадки.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация",Организация );
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Результат = Выборка.Ссылка;
		
	КонецЦикла; 
	
	
	Возврат Результат;
	
КонецФункции 

Функция КонтрольНаличияФотоРулонногоМатериала(Площадка, ДатаДокумента, МассивСерий) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Неопределено;
	ДатаКонтроля =Площадка.ДатаНачалаКонтроляНаличияФотоБиркиРулонногоМатериала;
	Если Не Площадка.КонтрольНаличияФотоБиркиРулонногоМатериала
		Или (ЗначениеЗаполнено(ДатаКонтроля) И ДатаКонтроля>=ДатаДокумента) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЯССМ_ОбъектыНоменклатуры.Ссылка КАК Ссылка,
	|	ЯССМ_ОбъектыНоменклатуры.Серия КАК Серия
	|ПОМЕСТИТЬ ВтОбъектыНоменклатуры
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатуры.Серия В(&МассивСерий)
	|	И ЯССМ_ОбъектыНоменклатуры.Рулонный
	|	И ЯССМ_ОбъектыНоменклатуры.Уникальный
	|	И ВЫБОР
	|			КОГДА &КонтрольДаты
	|				ТОГДА ЯССМ_ОбъектыНоменклатуры.ДатаФормирования >= &ДатаКонтроля
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ЯССМ_ОбъектыНоменклатуры.ЗакрытиеБланка = ЗНАЧЕНИЕ(Документ.Лико_БланкЭтапа.Пустаяссылка)
	|	И ЯССМ_ОбъектыНоменклатуры.ПриходныйОрдер <> ЗНАЧЕНИЕ(Документ.ПриходныйОрдерНаТовары.Пустаяссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОбъектыНоменклатуры.Серия КАК Серия
	|ИЗ
	|	ВтОбъектыНоменклатуры КАК ВтОбъектыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЯССМ_ОбъектыНоменклатурыПрисоединенныеФайлы КАК ЯССМ_ОбъектыНоменклатурыПрисоединенныеФайлы
	|		ПО ВтОбъектыНоменклатуры.Ссылка.Ссылка = ЯССМ_ОбъектыНоменклатурыПрисоединенныеФайлы.ВладелецФайла
	|			И (ЯССМ_ОбъектыНоменклатурыПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ)
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатурыПрисоединенныеФайлы.Ссылка ЕСТЬ NULL";
	Запрос.УстановитьПараметр("МассивСерий",МассивСерий );
	Запрос.УстановитьПараметр("КонтрольДаты",ЗначениеЗаполнено(ДатаКонтроля)); 
	Запрос.УстановитьПараметр("ДатаКонтроля",ДатаКонтроля);

	Результат =  Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Серия");
	
	
	 Возврат Результат;
	
КонецФункции 

Процедура КорректироватьПодразделениеПроизводствоПоПлощадке(ДокументОбъект) Экспорт	
	
	КорректироватьПодразделениеПроизводствоПоПлощадкеВнутреннееПотреблениеТоваров(ДокументОбъект);
	
КонецПроцедуры 


Процедура КорректироватьПодразделениеПроизводствоПоПлощадкеВнутреннееПотреблениеТоваров(ДокументОбъект)
	
	Если ТипЗнч(ДокументОбъект)<> Тип("ДокументОбъект.ВнутреннееПотребление") Тогда
		Возврат;
	КонецЕсли;

	
	ПодразделениеПроизводство = Справочники.Лико_ПредопределенныеЗначения.ПодразделениеПроизводство.ЗначениеПараметра;

	Площадка       = ДокументОбъект.Склад.Лико_Площадка;
	Подразделение  = Площадка.ПодразделениеПроизводство;
	
	
	Если  ПодразделениеПроизводство =  ДокументОбъект.Подразделение 
		И  ДокументОбъект.Подразделение <> Подразделение Тогда
		
		ДокументОбъект.Подразделение = Подразделение;
		  
	КонецЕсли;  	
	
 	
	Для каждого Товар Из ДокументОбъект.Товары Цикл 
		
		
		Если ПодразделениеПроизводство = Товар.АналитикаРасходов
			И  Товар.АналитикаРасходов<> Подразделение Тогда
			
			 Товар.АналитикаРасходов = Подразделение;
			 
		 КонецЕсли;
		 
	КонецЦикла;


	
	
	    	

КонецПроцедуры



#КонецОбласти

#КонецЕсли
